cmsis-svd/cmsis-svd/data/SiliconLabs/EFR32FG1V131F128GM48.svd
        <register>
          <name>DCDCLNCOMPCTRL</name>
          <description>DCDC Low Noise Compensator Control Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x57204077</resetValue>
          <resetMask>0xF730F1F7</resetMask>
          <fields>
            <field>
              <name>COMPENR1</name>
              <description>Low Noise Mode Compensator R1 Trim Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENR2</name>
              <description>Low Noise Mode Compensator R2 Trim Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENR3</name>
              <description>Low Noise Mode Compensator R3 Trim Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC1</name>
              <description>Low Noise Mode Compensator C1 Trim Value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC2</name>
              <description>Low Noise Mode Compensator C2 Trim Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENC3</name>
              <description>Low Noise Mode Compensator C3 Trim Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLNVCTRL</name>
          <description>DCDC Low Noise Voltage Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007100</resetValue>
          <resetMask>0x00007F02</resetMask>
          <fields>
            <field>
              <name>LNATT</name>
              <description>Low Noise Mode Feedback Attenuation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNVREF</name>
              <description>Low Noise Mode VREF Trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCTIMING</name>
          <description>DCDC Controller Timing Value Register</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0FF1F8FF</resetValue>
          <resetMask>0x6FF1F8FF</resetMask>
          <fields>
            <field>
              <name>LPINITWAIT</name>
              <description>Low Power Initialization Wait Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPENPRCHGEN</name>
              <description>LN Mode Precharge Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNWAIT</name>
              <description>Low Noise Controller Initialization Wait Time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPWAIT</name>
              <description>Bypass Mode Transition From Low Power or Low Noise Modes Wait Wait</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTYSCALE</name>
              <description>Select Bias Duty Cycle Clock</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLPVCTRL</name>
          <description>DCDC Low Power Voltage Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000168</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>LPATT</name>
              <description>Low Power Feedback Attenuation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVREF</name>
              <description>LP Mode Reference Selection for EM23 and EM4H</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLPCTRL</name>
          <description>DCDC Low Power Control Register</description>
          <addressOffset>0x06C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007000</resetValue>
          <resetMask>0x0700F000</resetMask>
          <fields>
            <field>
              <name>LPCMPHYSSEL</name>
              <description>LP Mode Hysteresis Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPVREFDUTYEN</name>
              <description>LP Mode Duty Cycling Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPBLANK</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCLNFREQCTRL</name>
          <description>DCDC Low Noise Controller Frequency Control</description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0x1F000007</resetMask>
          <fields>
            <field>
              <name>RCOBAND</name>
              <description>LN Mode RCO Frequency Band Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCOTRIM</name>
              <description>Reserved for internal use. Do not change.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCSYNC</name>
          <description>DCDC Read Status Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DCDCCTRLBUSY</name>
              <description>DCDC CTRL Register Transfer Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONAVDDCTRL</name>
          <description>VMON AVDD Channel Control</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESFINE</name>
              <description>Falling Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESCOARSE</name>
              <description>Falling Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESFINE</name>
              <description>Rising Threshold Fine Adjust</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESCOARSE</name>
              <description>Rising Threshold Coarse Adjust</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONALTAVDDCTRL</name>
          <description>Alternate VMON AVDD Channel Control</description>
          <addressOffset>0x094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONDVDDCTRL</name>
          <description>VMON DVDD Channel Control</description>
          <addressOffset>0x098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONIO0CTRL</name>
          <description>VMON IOVDD0 Channel Control</description>
          <addressOffset>0x09C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF1D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETDIS</name>
              <description>EM4 IO0 Retention Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIASCONF</name>
          <description>Configurations Related to the Bias</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000F8</resetValue>
          <resetMask>0x000000FC</resetMask>
          <fields>
            <field>
              <name>NADUTYEM01</name>
              <description>NA DUTY in EM01</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPEM01</name>
              <description>LP in EM01</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMCEM23</name>
              <description>GMC in EM234</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UADUTYEM23</name>
              <description>UADUTY in EM234</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NADUTYEM23</name>
              <description>NA DUTY in EM234</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPEM23</name>
              <description>LP in EM234</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTLOCK</name>
          <description>Test Lock Register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BIASTESTCTRL</name>
          <description>Test Control Register for Regulator and BIAS</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000008</resetMask>
          <fields>
            <field>
              <name>BIAS_RIP_RESET</name>
              <description>Reset Bias Ripple Counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
